{
"storyText":[
"Asteroid Terrarium: A recipe in 22 Steps",
"By best selling author and terraria craftsperson: Slartibartfast",
"Take an asteroid at least thirty kilometers on its long axis. Any type will do- solid rock, rock and ice, even ice balls, although each presents different problems.",
"Attach a self-replicating excavator assembly to one end of the asteroid, and with it, hollow out your asteroid along its long axis. Leave the wall at least two kilometers thick at all points except for your entry hole. Assure the interior integrity of the wall by coating it with a dura of suitable strength.",
"As your assembly hollows the interior, be aware that ejection of the excavated material (best aimed toward a Lagrange salvage point, to collect the salvage fee) will represent your best chance to reposition your terrarium, if you want it in a different orbit. Store excess ejecta on the surface for later use.",
"When the interior is hollowed out, leaving an empty cylinder at least five kilometers in diameter and ten kilometers long (but bigger is better!), your excavator assembly will return to the access hole and there reconfigure itself into your terrarium's propulsion unit. Depending on the mass of your new world, you may want to install a mass driver, an antimatter "lightening push" engine, or an Orion pusher plate.",
"Beyond the forward end of cylinder, on the bow of your new terrarium, attach a forward unit at the point of the long axis. Eventually your terrarium will be spinning at a rotational rate calculated to create the effect of gravity on the inner surface of the inner cylinder so that when you are inside, you will be pulled to the floor as if in a gravity field. This is the g equivalent, G-equivalent. The forward unit will then be connected to the bow of the terrarium by a geared axle, to allow the forward unit not to spin but instead to stay fixed. It will be nearly weightless in this bowsprit chamber, but many functions of the terrarium will go better without the spinning, including docking, viewing, navigating, etc.",
"It is possible to build an interior cylinder that spins freely inside an asteroid that does not spin- the so-called prayer wheel configuration -and this does give you both an interior with g effect and a non-spinning exterior, but it is expensive and finicky. Not recommended, though we have seen some good ones.",
"When stern and bow are properly installed and configured, and the asteroid is set spinning the interior is ready to be terraformed. ",
"Begin with a light dusting of heavy metals and rare earths, as specified for the biome you are trying to create. Be aware that no Terran biome ever began with simple ingredients you will be starting with on an asteroid. Biospheres need their vitamins right from the start, so be sure to arrange for the importation of the mix you want, usually including molybdenum, selenium, and phosphorous. These are often applied in "puff bombs" set off along the axis of the cylindrical space. Don't poison yourself when you do this!",
"After that, string the axis of the cylinder with your terrarium's sunline. This is a lighting element, on which the lit portion moves at whatever speed you choose. The lit portion of the sunline usually starts the day in the stern of cylinder, after a suitable period of darkness (during which any streetlights overhead will serve as stars). The lit portion of the line, appropriately bright, then traverses the sunline from stern to bow (or east to west, as some describe it), taking usually the same time as a Terran day, as measured by the latitude of your biome on Earth. Seasons inside your terrarium will be rendered accordingly.",
"Now you can aerate the interior to the gas mix and pressure you desire typically somewhere between 500 and 1100 millibars of pressure, in something like the Terran mix of gases, with perhaps a dash more oxygen, though the fire risk quickly rises there.",
"After that, you need biomass. Naturally you will have in your spice rack the complete genetic codes of all the creatures you intend to introduce into your biome. Generally you will be either recreating some Terran biome, or else mixing up something new, hybrid biomes most people call Ascensions, after Ascension Island on Earth, the site of the first such hybrid (started inadvertently by Darwin himself!) All the genomes for all the species of your particular biome will be available for print on demand, except for the bacteria involved, which are simply too numerous and too genetically labile to categorize. For them you will have to apply the appropriate inoculant, usually a muck or goo made of a few tons of the bacterial suite that you want. ",
"Luckily bacteria grow very fast in an empty ecological niche, which is what you now have. To make it even more welcoming, scrape the interior wall of your cylinder, then crumble the rock of the scrapings finely, to a consistency ranging from large gravel to sand. Mixed with an edible aerogel, this then becomes the matrix for your soil. Put all the ice gathered in your scraping aside, except for enough when melted to make your crumbled rock matrix moist. Then add your bacterial inoculant and turn up the heat to around three hundred K. The matrix will rise like yeasted dough as it becomes that most delicious and rare substance, soil. (Those wanting a fuller explanation of how to make soil are referred to my bestselling All About Dirt.)",
"With a soil base cooked up, your biome is well on it's way. Succession regimens at this point will, vary, depending on what you are looking for at climax. But it's true to say that a lot of terraria designers start out with a marsh of some kind, because it's the fastest way to bulk up your soil and overall biomass So if you are in a hurry to occupy, this is often a good way to start.",
"When you've got a warm marsh going, either freshwater or salt, you are already cooking good. Smells will rise in your cylinder, also hydrological problems. Fish, amphibian, animal and bird populations can be introduced at this point, and should be if you want maximum biomass growth. But here you have to watch out for a potential danger: once you get your marsh going, you may fall in love with it. Fine for you but it happens a bit too often. We have too many estuarine biomes now, and not enough of the other biomes we are hoping to cook out here.",
"So try to keep your distance at this point; keep a depopulate marsh, or stay away from it during this part of the process. Or join a trading scheme in which you trade asteroids when they are at the marsh point, so that you come into a new one wanting to change things, unattached to what's already there.",
"With the hefty biomass created by a marsh, you can then build up land using some of your excavated materials, saved on the surface of the asteroid for this moment. Hills and mountains look great and add texture, so be bold! This process will redirect your water into new hydrologies, and this is the best time to introduce new species, also to export species you no longer want, giving them to newer terraria that might need them.",
"Thus over time you can transform the interior of your terrarium to any of the 832 identified Terran biomes, or design and Ascension of your own making. (Be warned that many Ascensions fall as flat as bad souffles. The keys to a successful Ascension are so many that I have had to pen another volume, How to Mix and Match Biomes!, now available.)",
"Ultimately you will need to make many temperature, landscape, and species adjustments, to get to the kind of stable climax community you want. Any possible landscape is achievable; sometimes the results are simply stunning. Always the entire landscape will be curving up around you, rising on both sides and meeting overhead, so that the look of the land will envelop you like a work of art- a goldsworthy inscribed on the inside of a rock, like a geode or Faberge egg.",
"Obviously it is also possible to make interiors that are all liquid. Some of these aquaria or oceanaria include archipelagos; others are entirely water, even their walls, which are sometimes refrozen transparently so that in the end when you approach them, they look like diamonds or water droplets floating in space. Some aquaria have no air space in their middles.",
"As for aviaries, every terrarium and most aquaria are also aviaries, stuffed with birds to their maximum carrying capacity. There are fifty billion birds on Earth, twenty billion on Mars; we in the terraria could outmatch them both combined.",
"Each terrarium functions as an island park for the animals inside it. Ascensions cause hybridization and ultimately new species. The more traditional biomes conserve species that on Earth are radically endangered or extinct in the wild. Some terraria even look like zoos; more are purely wilderness refugia; and most mix parkland and human spaces in patterned habitat corridors that maximise the life of the biome as a whole. As such, these spaces are already crucial to humanity and the Earth. And there are also the heavily agricultural terraria, farmworlds devoted to producing what has become a very large percentage of the food feeding the people of Earth.",
"These facts are worth noting and enjoying. We cook up our little bubble worlds for our own pleasure, the way you would cook a meal, or build something, or grow a garden- but it's also a new thing in history, and the heart of the Accelerando. I can't recommend it too highly! The initial investment is nontrivial, but there are still many unclaimed asteroids out there."]
}
